RT-Thread/rt-thread/bsp/imxrt/libraries/MIMXRT1170/MIMXRT1171/periph/PERI_ENET_QOS.h
#define ENET_QOS_MAC_CONFIGURATION_RE_MASK       (0x1U)
#define ENET_QOS_MAC_CONFIGURATION_RE_SHIFT      (0U)
/*! RE - Receiver Enable
 *  0b0..Receiver is disabled
 *  0b1..Receiver is enabled
 */
#define ENET_QOS_MAC_CONFIGURATION_RE(x)         (((uint32_t)(((uint32_t)(x)) << ENET_QOS_MAC_CONFIGURATION_RE_SHIFT)) & ENET_QOS_MAC_CONFIGURATION_RE_MASK)

#define ENET_QOS_MAC_CONFIGURATION_TE_MASK       (0x2U)
#define ENET_QOS_MAC_CONFIGURATION_TE_SHIFT      (1U)
/*! TE - Transmitter Enable
 *  0b0..Transmitter is disabled
 *  0b1..Transmitter is enabled
 */
#define ENET_QOS_MAC_CONFIGURATION_TE(x)         (((uint32_t)(((uint32_t)(x)) << ENET_QOS_MAC_CONFIGURATION_TE_SHIFT)) & ENET_QOS_MAC_CONFIGURATION_TE_MASK)

#define ENET_QOS_MAC_CONFIGURATION_PRELEN_MASK   (0xCU)
#define ENET_QOS_MAC_CONFIGURATION_PRELEN_SHIFT  (2U)
/*! PRELEN - Preamble Length for Transmit packets
 *  0b00..7 bytes of preamble
 *  0b01..5 bytes of preamble
 *  0b10..3 bytes of preamble
 *  0b11..Reserved
 */
#define ENET_QOS_MAC_CONFIGURATION_PRELEN(x)     (((uint32_t)(((uint32_t)(x)) << ENET_QOS_MAC_CONFIGURATION_PRELEN_SHIFT)) & ENET_QOS_MAC_CONFIGURATION_PRELEN_MASK)

#define ENET_QOS_MAC_CONFIGURATION_DC_MASK       (0x10U)
#define ENET_QOS_MAC_CONFIGURATION_DC_SHIFT      (4U)
/*! DC - Deferral Check
 *  0b0..Deferral check function is disabled
 *  0b1..Deferral check function is enabled
 */
#define ENET_QOS_MAC_CONFIGURATION_DC(x)         (((uint32_t)(((uint32_t)(x)) << ENET_QOS_MAC_CONFIGURATION_DC_SHIFT)) & ENET_QOS_MAC_CONFIGURATION_DC_MASK)

#define ENET_QOS_MAC_CONFIGURATION_BL_MASK       (0x60U)
#define ENET_QOS_MAC_CONFIGURATION_BL_SHIFT      (5U)
/*! BL - Back-Off Limit
 *  0b00..k = min(n,10)
 *  0b01..k = min(n,8)
 *  0b10..k = min(n,4)
 *  0b11..k = min(n,1)
 */
#define ENET_QOS_MAC_CONFIGURATION_BL(x)         (((uint32_t)(((uint32_t)(x)) << ENET_QOS_MAC_CONFIGURATION_BL_SHIFT)) & ENET_QOS_MAC_CONFIGURATION_BL_MASK)

#define ENET_QOS_MAC_CONFIGURATION_DR_MASK       (0x100U)
#define ENET_QOS_MAC_CONFIGURATION_DR_SHIFT      (8U)
/*! DR - Disable Retry
 *  0b0..Enable Retry
 *  0b1..Disable Retry
 */
#define ENET_QOS_MAC_CONFIGURATION_DR(x)         (((uint32_t)(((uint32_t)(x)) << ENET_QOS_MAC_CONFIGURATION_DR_SHIFT)) & ENET_QOS_MAC_CONFIGURATION_DR_MASK)

#define ENET_QOS_MAC_CONFIGURATION_DCRS_MASK     (0x200U)
#define ENET_QOS_MAC_CONFIGURATION_DCRS_SHIFT    (9U)
/*! DCRS - Disable Carrier Sense During Transmission
 *  0b0..Enable Carrier Sense During Transmission
 *  0b1..Disable Carrier Sense During Transmission
 */
#define ENET_QOS_MAC_CONFIGURATION_DCRS(x)       (((uint32_t)(((uint32_t)(x)) << ENET_QOS_MAC_CONFIGURATION_DCRS_SHIFT)) & ENET_QOS_MAC_CONFIGURATION_DCRS_MASK)

#define ENET_QOS_MAC_CONFIGURATION_DO_MASK       (0x400U)
#define ENET_QOS_MAC_CONFIGURATION_DO_SHIFT      (10U)
/*! DO - Disable Receive Own
 *  0b0..Enable Receive Own
 *  0b1..Disable Receive Own
 */
#define ENET_QOS_MAC_CONFIGURATION_DO(x)         (((uint32_t)(((uint32_t)(x)) << ENET_QOS_MAC_CONFIGURATION_DO_SHIFT)) & ENET_QOS_MAC_CONFIGURATION_DO_MASK)

#define ENET_QOS_MAC_CONFIGURATION_ECRSFD_MASK   (0x800U)
#define ENET_QOS_MAC_CONFIGURATION_ECRSFD_SHIFT  (11U)
/*! ECRSFD - Enable Carrier Sense Before Transmission in Full-Duplex Mode
 *  0b0..ECRSFD is disabled
 *  0b1..ECRSFD is enabled
 */
#define ENET_QOS_MAC_CONFIGURATION_ECRSFD(x)     (((uint32_t)(((uint32_t)(x)) << ENET_QOS_MAC_CONFIGURATION_ECRSFD_SHIFT)) & ENET_QOS_MAC_CONFIGURATION_ECRSFD_MASK)

#define ENET_QOS_MAC_CONFIGURATION_LM_MASK       (0x1000U)
#define ENET_QOS_MAC_CONFIGURATION_LM_SHIFT      (12U)
/*! LM - Loopback Mode
 *  0b0..Loopback is disabled
 *  0b1..Loopback is enabled
 */
#define ENET_QOS_MAC_CONFIGURATION_LM(x)         (((uint32_t)(((uint32_t)(x)) << ENET_QOS_MAC_CONFIGURATION_LM_SHIFT)) & ENET_QOS_MAC_CONFIGURATION_LM_MASK)

#define ENET_QOS_MAC_CONFIGURATION_DM_MASK       (0x2000U)
#define ENET_QOS_MAC_CONFIGURATION_DM_SHIFT      (13U)
/*! DM - Duplex Mode
 *  0b0..Half-duplex mode
 *  0b1..Full-duplex mode
 */
#define ENET_QOS_MAC_CONFIGURATION_DM(x)         (((uint32_t)(((uint32_t)(x)) << ENET_QOS_MAC_CONFIGURATION_DM_SHIFT)) & ENET_QOS_MAC_CONFIGURATION_DM_MASK)

#define ENET_QOS_MAC_CONFIGURATION_FES_MASK      (0x4000U)
#define ENET_QOS_MAC_CONFIGURATION_FES_SHIFT     (14U)
/*! FES - Speed
 *  0b0..10 Mbps when PS bit is 1 and 1 Gbps when PS bit is 0
 *  0b1..100 Mbps when PS bit is 1 and 2.5 Gbps when PS bit is 0
 */
#define ENET_QOS_MAC_CONFIGURATION_FES(x)        (((uint32_t)(((uint32_t)(x)) << ENET_QOS_MAC_CONFIGURATION_FES_SHIFT)) & ENET_QOS_MAC_CONFIGURATION_FES_MASK)

#define ENET_QOS_MAC_CONFIGURATION_PS_MASK       (0x8000U)
#define ENET_QOS_MAC_CONFIGURATION_PS_SHIFT      (15U)
/*! PS - Port Select
 *  0b0..For 1000 or 2500 Mbps operations
 *  0b1..For 10 or 100 Mbps operations
 */
#define ENET_QOS_MAC_CONFIGURATION_PS(x)         (((uint32_t)(((uint32_t)(x)) << ENET_QOS_MAC_CONFIGURATION_PS_SHIFT)) & ENET_QOS_MAC_CONFIGURATION_PS_MASK)

#define ENET_QOS_MAC_CONFIGURATION_JE_MASK       (0x10000U)
#define ENET_QOS_MAC_CONFIGURATION_JE_SHIFT      (16U)
/*! JE - Jumbo Packet Enable When this bit is set, the MAC allows jumbo packets of 9,018 bytes
 *    (9,022 bytes for VLAN tagged packets) without reporting a giant packet error in the Rx packet
 *    status.
 *  0b0..Jumbo packet is disabled
 *  0b1..Jumbo packet is enabled
 */
#define ENET_QOS_MAC_CONFIGURATION_JE(x)         (((uint32_t)(((uint32_t)(x)) << ENET_QOS_MAC_CONFIGURATION_JE_SHIFT)) & ENET_QOS_MAC_CONFIGURATION_JE_MASK)

#define ENET_QOS_MAC_CONFIGURATION_JD_MASK       (0x20000U)
#define ENET_QOS_MAC_CONFIGURATION_JD_SHIFT      (17U)
/*! JD - Jabber Disable
 *  0b0..Jabber is enabled
 *  0b1..Jabber is disabled
 */
#define ENET_QOS_MAC_CONFIGURATION_JD(x)         (((uint32_t)(((uint32_t)(x)) << ENET_QOS_MAC_CONFIGURATION_JD_SHIFT)) & ENET_QOS_MAC_CONFIGURATION_JD_MASK)

#define ENET_QOS_MAC_CONFIGURATION_BE_MASK       (0x40000U)
#define ENET_QOS_MAC_CONFIGURATION_BE_SHIFT      (18U)
/*! BE - Packet Burst Enable When this bit is set, the MAC allows packet bursting during
 *    transmission in the GMII half-duplex mode.
 *  0b0..Packet Burst is disabled
 *  0b1..Packet Burst is enabled
 */
#define ENET_QOS_MAC_CONFIGURATION_BE(x)         (((uint32_t)(((uint32_t)(x)) << ENET_QOS_MAC_CONFIGURATION_BE_SHIFT)) & ENET_QOS_MAC_CONFIGURATION_BE_MASK)

#define ENET_QOS_MAC_CONFIGURATION_WD_MASK       (0x80000U)
#define ENET_QOS_MAC_CONFIGURATION_WD_SHIFT      (19U)
/*! WD - Watchdog Disable
 *  0b0..Watchdog is enabled
 *  0b1..Watchdog is disabled
 */
#define ENET_QOS_MAC_CONFIGURATION_WD(x)         (((uint32_t)(((uint32_t)(x)) << ENET_QOS_MAC_CONFIGURATION_WD_SHIFT)) & ENET_QOS_MAC_CONFIGURATION_WD_MASK)

#define ENET_QOS_MAC_CONFIGURATION_ACS_MASK      (0x100000U)
#define ENET_QOS_MAC_CONFIGURATION_ACS_SHIFT     (20U)
/*! ACS - Automatic Pad or CRC Stripping When this bit is set, the MAC strips the Pad or FCS field
 *    on the incoming packets only if the value of the length field is less than 1,536 bytes.
 *  0b0..Automatic Pad or CRC Stripping is disabled
 *  0b1..Automatic Pad or CRC Stripping is enabled
 */
#define ENET_QOS_MAC_CONFIGURATION_ACS(x)        (((uint32_t)(((uint32_t)(x)) << ENET_QOS_MAC_CONFIGURATION_ACS_SHIFT)) & ENET_QOS_MAC_CONFIGURATION_ACS_MASK)

