RT-Thread/rt-thread/bsp/imxrt/libraries/MIMXRT1170/MIMXRT1171/periph/PERI_ENET_QOS.h
/*! @name MAC_VERSION - MAC Version */
/*! @{ */

#define ENET_QOS_MAC_VERSION_SNPSVER_MASK        (0xFFU)
#define ENET_QOS_MAC_VERSION_SNPSVER_SHIFT       (0U)
/*! SNPSVER - Synopsys-defined Version */
#define ENET_QOS_MAC_VERSION_SNPSVER(x)          (((uint32_t)(((uint32_t)(x)) << ENET_QOS_MAC_VERSION_SNPSVER_SHIFT)) & ENET_QOS_MAC_VERSION_SNPSVER_MASK)

#define ENET_QOS_MAC_VERSION_USERVER_MASK        (0xFF00U)
#define ENET_QOS_MAC_VERSION_USERVER_SHIFT       (8U)
/*! USERVER - User-defined Version (8'h10) */
#define ENET_QOS_MAC_VERSION_USERVER(x)          (((uint32_t)(((uint32_t)(x)) << ENET_QOS_MAC_VERSION_USERVER_SHIFT)) & ENET_QOS_MAC_VERSION_USERVER_MASK)
/*! @} */

/*! @name MAC_DEBUG - MAC Debug */
/*! @{ */

#define ENET_QOS_MAC_DEBUG_RPESTS_MASK           (0x1U)
#define ENET_QOS_MAC_DEBUG_RPESTS_SHIFT          (0U)
/*! RPESTS - MAC GMII or MII Receive Protocol Engine Status When this bit is set, it indicates that
 *    the MAC GMII or MII receive protocol engine is actively receiving data, and it is not in the
 *    Idle state.
 *  0b0..MAC GMII or MII Receive Protocol Engine Status not detected
 *  0b1..MAC GMII or MII Receive Protocol Engine Status detected
 */
#define ENET_QOS_MAC_DEBUG_RPESTS(x)             (((uint32_t)(((uint32_t)(x)) << ENET_QOS_MAC_DEBUG_RPESTS_SHIFT)) & ENET_QOS_MAC_DEBUG_RPESTS_MASK)

#define ENET_QOS_MAC_DEBUG_RFCFCSTS_MASK         (0x6U)
#define ENET_QOS_MAC_DEBUG_RFCFCSTS_SHIFT        (1U)
/*! RFCFCSTS - MAC Receive Packet Controller FIFO Status When this bit is set, this field indicates
 *    the active state of the small FIFO Read and Write controllers of the MAC Receive Packet
 *    Controller module.
 */
#define ENET_QOS_MAC_DEBUG_RFCFCSTS(x)           (((uint32_t)(((uint32_t)(x)) << ENET_QOS_MAC_DEBUG_RFCFCSTS_SHIFT)) & ENET_QOS_MAC_DEBUG_RFCFCSTS_MASK)

#define ENET_QOS_MAC_DEBUG_TPESTS_MASK           (0x10000U)
#define ENET_QOS_MAC_DEBUG_TPESTS_SHIFT          (16U)
/*! TPESTS - MAC GMII or MII Transmit Protocol Engine Status When this bit is set, it indicates that
 *    the MAC GMII or MII transmit protocol engine is actively transmitting data, and it is not in
 *    the Idle state.
 *  0b0..MAC GMII or MII Transmit Protocol Engine Status not detected
 *  0b1..MAC GMII or MII Transmit Protocol Engine Status detected
 */
#define ENET_QOS_MAC_DEBUG_TPESTS(x)             (((uint32_t)(((uint32_t)(x)) << ENET_QOS_MAC_DEBUG_TPESTS_SHIFT)) & ENET_QOS_MAC_DEBUG_TPESTS_MASK)

#define ENET_QOS_MAC_DEBUG_TFCSTS_MASK           (0x60000U)
#define ENET_QOS_MAC_DEBUG_TFCSTS_SHIFT          (17U)
/*! TFCSTS - MAC Transmit Packet Controller Status This field indicates the state of the MAC Transmit Packet Controller module.
 *  0b00..Idle state
 *  0b01..Waiting for one of the following: Status of the previous packet OR IPG or back off period to be over
 *  0b10..Generating and transmitting a Pause control packet (in full-duplex mode)
 *  0b11..Transferring input packet for transmission
 */
#define ENET_QOS_MAC_DEBUG_TFCSTS(x)             (((uint32_t)(((uint32_t)(x)) << ENET_QOS_MAC_DEBUG_TFCSTS_SHIFT)) & ENET_QOS_MAC_DEBUG_TFCSTS_MASK)
/*! @} */

/*! @name MAC_HW_FEAT - Optional Features or Functions 0..Optional Features or Functions 3 */
/*! @{ */

#define ENET_QOS_MAC_HW_FEAT_MIISEL_MASK         (0x1U)
#define ENET_QOS_MAC_HW_FEAT_MIISEL_SHIFT        (0U)
/*! MIISEL - 10 or 100 Mbps Support This bit is set to 1 when 10/100 Mbps is selected as the Mode of Operation
 *  0b0..No 10 or 100 Mbps support
 *  0b1..10 or 100 Mbps support
 */
#define ENET_QOS_MAC_HW_FEAT_MIISEL(x)           (((uint32_t)(((uint32_t)(x)) << ENET_QOS_MAC_HW_FEAT_MIISEL_SHIFT)) & ENET_QOS_MAC_HW_FEAT_MIISEL_MASK)

#define ENET_QOS_MAC_HW_FEAT_NRVF_MASK           (0x7U)
#define ENET_QOS_MAC_HW_FEAT_NRVF_SHIFT          (0U)
/*! NRVF - Number of Extended VLAN Tag Filters Enabled This field indicates the Number of Extended VLAN Tag Filters selected:
 *  0b000..No Extended Rx VLAN Filters
 *  0b001..4 Extended Rx VLAN Filters
 *  0b010..8 Extended Rx VLAN Filters
 *  0b011..16 Extended Rx VLAN Filters
 *  0b100..24 Extended Rx VLAN Filters
 *  0b101..32 Extended Rx VLAN Filters
 *  0b110..Reserved
 */
#define ENET_QOS_MAC_HW_FEAT_NRVF(x)             (((uint32_t)(((uint32_t)(x)) << ENET_QOS_MAC_HW_FEAT_NRVF_SHIFT)) & ENET_QOS_MAC_HW_FEAT_NRVF_MASK)

#define ENET_QOS_MAC_HW_FEAT_RXFIFOSIZE_MASK     (0x1FU)
#define ENET_QOS_MAC_HW_FEAT_RXFIFOSIZE_SHIFT    (0U)
/*! RXFIFOSIZE - MTL Receive FIFO Size This field contains the configured value of MTL Rx FIFO in
 *    bytes expressed as Log to base 2 minus 7, that is, Log2(RXFIFO_SIZE) -7:
 *  0b00000..128 bytes
 *  0b00001..256 bytes
 *  0b00010..512 bytes
 *  0b00011..1024 bytes
 *  0b00100..2048 bytes
 *  0b00101..4096 bytes
 *  0b00110..8192 bytes
 *  0b00111..16384 bytes
 *  0b01000..32 KB
 *  0b01001..64 KB
 *  0b01010..128 KB
 *  0b01011..256 KB
 *  0b01100..Reserved
 */
#define ENET_QOS_MAC_HW_FEAT_RXFIFOSIZE(x)       (((uint32_t)(((uint32_t)(x)) << ENET_QOS_MAC_HW_FEAT_RXFIFOSIZE_SHIFT)) & ENET_QOS_MAC_HW_FEAT_RXFIFOSIZE_MASK)

#define ENET_QOS_MAC_HW_FEAT_RXQCNT_MASK         (0xFU)
#define ENET_QOS_MAC_HW_FEAT_RXQCNT_SHIFT        (0U)
/*! RXQCNT - Number of MTL Receive Queues This field indicates the number of MTL Receive queues:
 *  0b0000..1 MTL Rx Queue
 *  0b0001..2 MTL Rx Queues
 *  0b0010..3 MTL Rx Queues
 *  0b0011..4 MTL Rx Queues
 *  0b0100..5 MTL Rx Queues
 *  0b0101..Reserved
 *  0b0110..Reserved
 *  0b0111..Reserved
 */
#define ENET_QOS_MAC_HW_FEAT_RXQCNT(x)           (((uint32_t)(((uint32_t)(x)) << ENET_QOS_MAC_HW_FEAT_RXQCNT_SHIFT)) & ENET_QOS_MAC_HW_FEAT_RXQCNT_MASK)

#define ENET_QOS_MAC_HW_FEAT_GMIISEL_MASK        (0x2U)
#define ENET_QOS_MAC_HW_FEAT_GMIISEL_SHIFT       (1U)
/*! GMIISEL - 1000 Mbps Support This bit is set to 1 when 1000 Mbps is selected as the Mode of Operation
 *  0b0..No 1000 Mbps support
 *  0b1..1000 Mbps support
 */
#define ENET_QOS_MAC_HW_FEAT_GMIISEL(x)          (((uint32_t)(((uint32_t)(x)) << ENET_QOS_MAC_HW_FEAT_GMIISEL_SHIFT)) & ENET_QOS_MAC_HW_FEAT_GMIISEL_MASK)

#define ENET_QOS_MAC_HW_FEAT_HDSEL_MASK          (0x4U)
#define ENET_QOS_MAC_HW_FEAT_HDSEL_SHIFT         (2U)
/*! HDSEL - Half-duplex Support This bit is set to 1 when the half-duplex mode is selected
 *  0b0..No Half-duplex support
 *  0b1..Half-duplex support
 */
#define ENET_QOS_MAC_HW_FEAT_HDSEL(x)            (((uint32_t)(((uint32_t)(x)) << ENET_QOS_MAC_HW_FEAT_HDSEL_SHIFT)) & ENET_QOS_MAC_HW_FEAT_HDSEL_MASK)

#define ENET_QOS_MAC_HW_FEAT_PCSSEL_MASK         (0x8U)
#define ENET_QOS_MAC_HW_FEAT_PCSSEL_SHIFT        (3U)
/*! PCSSEL - PCS Registers (TBI, SGMII, or RTBI PHY interface) This bit is set to 1 when the TBI,
 *    SGMII, or RTBI PHY interface option is selected
 *  0b0..No PCS Registers (TBI, SGMII, or RTBI PHY interface)
 *  0b1..PCS Registers (TBI, SGMII, or RTBI PHY interface)
 */
#define ENET_QOS_MAC_HW_FEAT_PCSSEL(x)           (((uint32_t)(((uint32_t)(x)) << ENET_QOS_MAC_HW_FEAT_PCSSEL_SHIFT)) & ENET_QOS_MAC_HW_FEAT_PCSSEL_MASK)

#define ENET_QOS_MAC_HW_FEAT_CBTISEL_MASK        (0x10U)
#define ENET_QOS_MAC_HW_FEAT_CBTISEL_SHIFT       (4U)
/*! CBTISEL - Queue/Channel based VLAN tag insertion on Tx Enable This bit is set to 1 when the
 *    Enable Queue/Channel based VLAN tag insertion on Tx Feature is selected.
 *  0b0..Enable Queue/Channel based VLAN tag insertion on Tx feature is not selected
 *  0b1..Enable Queue/Channel based VLAN tag insertion on Tx feature is selected
 */
#define ENET_QOS_MAC_HW_FEAT_CBTISEL(x)          (((uint32_t)(((uint32_t)(x)) << ENET_QOS_MAC_HW_FEAT_CBTISEL_SHIFT)) & ENET_QOS_MAC_HW_FEAT_CBTISEL_MASK)

#define ENET_QOS_MAC_HW_FEAT_VLHASH_MASK         (0x10U)
#define ENET_QOS_MAC_HW_FEAT_VLHASH_SHIFT        (4U)
/*! VLHASH - VLAN Hash Filter Selected This bit is set to 1 when the Enable VLAN Hash Table Based Filtering option is selected
 *  0b0..VLAN Hash Filter not selected
 *  0b1..VLAN Hash Filter selected
 */
#define ENET_QOS_MAC_HW_FEAT_VLHASH(x)           (((uint32_t)(((uint32_t)(x)) << ENET_QOS_MAC_HW_FEAT_VLHASH_SHIFT)) & ENET_QOS_MAC_HW_FEAT_VLHASH_MASK)

#define ENET_QOS_MAC_HW_FEAT_DVLAN_MASK          (0x20U)
#define ENET_QOS_MAC_HW_FEAT_DVLAN_SHIFT         (5U)
/*! DVLAN - Double VLAN Tag Processing Selected This bit is set to 1 when the Enable Double VLAN Processing Feature is selected.
 *  0b0..Double VLAN option is not selected
 *  0b1..Double VLAN option is selected
 */
#define ENET_QOS_MAC_HW_FEAT_DVLAN(x)            (((uint32_t)(((uint32_t)(x)) << ENET_QOS_MAC_HW_FEAT_DVLAN_SHIFT)) & ENET_QOS_MAC_HW_FEAT_DVLAN_MASK)

#define ENET_QOS_MAC_HW_FEAT_SMASEL_MASK         (0x20U)
#define ENET_QOS_MAC_HW_FEAT_SMASEL_SHIFT        (5U)
/*! SMASEL - SMA (MDIO) Interface This bit is set to 1 when the Enable Station Management (MDIO Interface) option is selected
 *  0b0..SMA (MDIO) Interface not selected
 *  0b1..SMA (MDIO) Interface selected
 */
#define ENET_QOS_MAC_HW_FEAT_SMASEL(x)           (((uint32_t)(((uint32_t)(x)) << ENET_QOS_MAC_HW_FEAT_SMASEL_SHIFT)) & ENET_QOS_MAC_HW_FEAT_SMASEL_MASK)

#define ENET_QOS_MAC_HW_FEAT_SPRAM_MASK          (0x20U)
#define ENET_QOS_MAC_HW_FEAT_SPRAM_SHIFT         (5U)
/*! SPRAM - Single Port RAM Enable This bit is set to 1 when the Use single port RAM Feature is selected.
 *  0b0..Single Port RAM feature is not selected
 *  0b1..Single Port RAM feature is selected
 */
#define ENET_QOS_MAC_HW_FEAT_SPRAM(x)            (((uint32_t)(((uint32_t)(x)) << ENET_QOS_MAC_HW_FEAT_SPRAM_SHIFT)) & ENET_QOS_MAC_HW_FEAT_SPRAM_MASK)

#define ENET_QOS_MAC_HW_FEAT_RWKSEL_MASK         (0x40U)
#define ENET_QOS_MAC_HW_FEAT_RWKSEL_SHIFT        (6U)
/*! RWKSEL - PMT Remote Wake-up Packet Enable This bit is set to 1 when the Enable Remote Wake-Up Packet Detection option is selected
 *  0b0..PMT Remote Wake-up Packet Enable option is not selected
 *  0b1..PMT Remote Wake-up Packet Enable option is selected
 */
#define ENET_QOS_MAC_HW_FEAT_RWKSEL(x)           (((uint32_t)(((uint32_t)(x)) << ENET_QOS_MAC_HW_FEAT_RWKSEL_SHIFT)) & ENET_QOS_MAC_HW_FEAT_RWKSEL_MASK)

#define ENET_QOS_MAC_HW_FEAT_TXFIFOSIZE_MASK     (0x7C0U)
#define ENET_QOS_MAC_HW_FEAT_TXFIFOSIZE_SHIFT    (6U)
/*! TXFIFOSIZE - MTL Transmit FIFO Size This field contains the configured value of MTL Tx FIFO in
 *    bytes expressed as Log to base 2 minus 7, that is, Log2(TXFIFO_SIZE) -7:
 *  0b00000..128 bytes
 *  0b00001..256 bytes
 *  0b00010..512 bytes
 *  0b00011..1024 bytes
 *  0b00100..2048 bytes
 *  0b00101..4096 bytes
 *  0b00110..8192 bytes
 *  0b00111..16384 bytes
 *  0b01000..32 KB
 *  0b01001..64 KB
 *  0b01010..128 KB
 *  0b01011..Reserved
 */
#define ENET_QOS_MAC_HW_FEAT_TXFIFOSIZE(x)       (((uint32_t)(((uint32_t)(x)) << ENET_QOS_MAC_HW_FEAT_TXFIFOSIZE_SHIFT)) & ENET_QOS_MAC_HW_FEAT_TXFIFOSIZE_MASK)

